#### Terraform Plan Output
   ```
   module.fabric.apstra_asn_pool.spine: Refreshing state... [id=d5190188-40f0-4b31-8fe8-1eeccc556fb0]
module.fabric.apstra_ipv4_pool.leaf: Refreshing state... [id=2b55fddb-60f9-4dd6-b11e-b92cb39c7821]
module.fabric.apstra_datacenter_blueprint.dc_1: Refreshing state... [id=87873b99-a6b3-47ac-b5fa-1bc625552ba1]
module.fabric.apstra_ipv4_pool.spine: Refreshing state... [id=284657f6-6c22-4dfa-8360-f3516c3e3790]
module.fabric.apstra_ipv4_pool.spine_leaf: Refreshing state... [id=50dabdf9-b1e2-4212-bfa2-49dbbf4da37a]
module.fabric.apstra_asn_pool.leaf: Refreshing state... [id=22e0d81e-a595-4955-b9e1-6c62b0ca8693]
module.fabric.apstra_datacenter_resource_pool_allocation.leaf_lo: Refreshing state...
module.fabric.apstra_datacenter_resource_pool_allocation.spine_lo: Refreshing state...
module.fabric.apstra_datacenter_resource_pool_allocation.spine_asn: Refreshing state...
module.fabric.apstra_datacenter_device_allocation.all["spine2"]: Refreshing state...
module.fabric.apstra_datacenter_device_allocation.all["l2_virtual_002_leaf1"]: Refreshing state...
module.fabric.apstra_datacenter_device_allocation.all["l2_virtual_003_leaf1"]: Refreshing state...
module.fabric.apstra_datacenter_device_allocation.all["l2_virtual_004_leaf1"]: Refreshing state...
module.fabric.apstra_datacenter_device_allocation.all["spine1"]: Refreshing state...
module.fabric.data.apstra_datacenter_routing_zone.default: Reading...
module.fabric.apstra_datacenter_device_allocation.all["l2_virtual_001_leaf1"]: Refreshing state...
module.fabric.apstra_datacenter_resource_pool_allocation.leaf_asn: Refreshing state...
module.fabric.apstra_datacenter_resource_pool_allocation.spine_leaf: Refreshing state...
module.vpn_routing.apstra_datacenter_routing_policy.vpn["customer_a"]: Refreshing state... [id=Jspkf4yjYsHS0yy4NAc]
module.fabric.data.apstra_datacenter_routing_zone.default: Read complete after 1s [id=p_0r2KtM86qJzs4NTaA]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["vendor_a"]: Refreshing state... [id=f08I5fBKZ_9efolvCW8]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["vendor_b"]: Refreshing state... [id=Qpi-APNAVxeDyGqZuSQ]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["customer_b"]: Refreshing state... [id=HOfdU8vKMGXaYn6uFIU]
module.fabric.data.apstra_blueprint_deployment.dc_1: Reading...
module.vpn_routing.apstra_datacenter_connectivity_template.vpn: Refreshing state... [id=4bbf090e-37f2-11ee-86fe-617073747261]
module.fabric.data.apstra_blueprint_deployment.dc_1: Read complete after 1s
null_resource.force_redeploy: Refreshing state... [id=2485860336921062224]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # apstra_blueprint_deployment.dc_1 will be created
  + resource "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "87873b99-a6b3-47ac-b5fa-1bc625552ba1"
      + comment                 = "Deployment by Terraform {{.TerraformVersion}}, Apstra provider {{.ProviderVersion}}, User $USER."
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "2485860336921062224" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision"      = "25" -> "27"
          ~ "vpn_routing_staging_revision" = "26" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "87873b99-a6b3-47ac-b5fa-1bc625552ba1"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_bgp_peering_ip_endpoint" "vpn" {
      + child_primitives = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + ipv4_address     = "192.168.5.5"
      + primitive        = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_ip_link" "vpn" {
      + child_primitives     = [
          + (known after apply),
        ]
      + ipv4_addressing_type = "numbered"
      + primitive            = (known after apply)
      + routing_zone_id      = "p_0r2KtM86qJzs4NTaA"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["customer_a"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = "Jspkf4yjYsHS0yy4NAc"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["vendor_a"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = "f08I5fBKZ_9efolvCW8"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["vendor_b"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = "Qpi-APNAVxeDyGqZuSQ"
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template.vpn will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template" "vpn" {
      ~ description  = "includes routing policies for [customer_a, customer_b, vendor_a, vendor_b]" -> "includes routing policies for [customer_a, vendor_a, vendor_b]"
        id           = "4bbf090e-37f2-11ee-86fe-617073747261"
        name         = "IP+BGP handoff to VPN block"
      ~ primitives   = [
          - jsonencode(
                {
                  - data = {
                      - child_primitives     = [
                          - jsonencode(
                                {
                                  - data = {
                                      - bfd_enabled          = false
                                      - child_primitives     = [
                                          - jsonencode(
                                                {
                                                  - data = {
                                                      - routing_policy_id = "Qpi-APNAVxeDyGqZuSQ"
                                                    }
                                                  - type = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                          - jsonencode(
                                                {
                                                  - data = {
                                                      - routing_policy_id = "Jspkf4yjYsHS0yy4NAc"
                                                    }
                                                  - type = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                          - jsonencode(
                                                {
                                                  - data = {
                                                      - routing_policy_id = "HOfdU8vKMGXaYn6uFIU"
                                                    }
                                                  - type = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                          - jsonencode(
                                                {
                                                  - data = {
                                                      - routing_policy_id = "f08I5fBKZ_9efolvCW8"
                                                    }
                                                  - type = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                        ]
                                      - hold_time            = null
                                      - ipv4_address         = "192.168.5.5"
                                      - ipv4_afi_enabled     = true
                                      - ipv6_address         = null
                                      - ipv6_afi_enabled     = false
                                      - keepalive_time       = null
                                      - local_asn            = null
                                      - neighbor_asn         = null
                                      - neighbor_asn_dynaimc = true
                                      - password             = null
                                      - ttl                  = 0
                                    }
                                  - type = "AttachIpEndpointWithBgpNsxt"
                                }
                            ),
                        ]
                      - ipv4_addressing_type = "numbered"
                      - ipv6_addressing_type = "none"
                      - routing_zone_id      = "p_0r2KtM86qJzs4NTaA"
                      - tagged               = false
                    }
                  - type = "AttachLogicalLink"
                }
            ),
          + (known after apply),
        ]
        tags         = [
            "terraform",
            "test",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["customer_b"] will be destroyed
  # (because key ["customer_b"] is not in for_each map)
  - resource "apstra_datacenter_routing_policy" "vpn" {
      - blueprint_id        = "87873b99-a6b3-47ac-b5fa-1bc625552ba1" -> null
      - expect_default_ipv4 = true -> null
      - expect_default_ipv6 = true -> null
      - export_policy       = {
          - export_l2_edge_subnets        = false -> null
          - export_l3_edge_server_links   = false -> null
          - export_loopbacks              = false -> null
          - export_spine_leaf_links       = false -> null
          - export_spine_superspine_links = false -> null
          - export_static_routes          = false -> null
        } -> null
      - extra_exports       = [
          - {
              - action = "permit" -> null
              - prefix = "10.55.0.0/24" -> null
            },
        ] -> null
      - extra_imports       = [
          - {
              - action = "permit" -> null
              - prefix = "172.55.0.0/24" -> null
            },
          - {
              - action = "permit" -> null
              - prefix = "172.55.15.0/24" -> null
            },
          - {
              - action = "permit" -> null
              - prefix = "172.55.66.0/24" -> null
            },
        ] -> null
      - id                  = "HOfdU8vKMGXaYn6uFIU" -> null
      - import_policy       = "extra_only" -> null
      - name                = "customer_b" -> null
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   